alekseychaikovsky.line-jumper
bmewburn.vscode-intelephense-client
christian-kohler.path-intellisense 
CoenraadS.bracket-pair-colorizer-2 
dawhite.mustache
donjayamanne.githistory
dsznajder.es7-react-js-snippets    
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag       
formulahendry.auto-rename-tag      
formulahendry.code-runner
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode.cpptools
msjsdiag.vscode-react-native
oderwat.indent-rainbow
onecentlin.laravel5-snippets
PKief.material-icon-theme
redhat.java
ritwickdey.live-sass
ritwickdey.LiveServer
thekalinga.bootstrap4-vscode
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
wayou.vscode-todo-highlight
xabikos.JavaScriptSnippets
xdebug.php-debug
xdebug.php-pack
zhuangtongfa.material-theme
zobo.php-intellisense